# SetOpacityN

## Description
```pascal
FUNCTION SetOpacityN(
				h             : HANDLE;
				inPenOpacity  : INTEGER;
				inFillOpacity : INTEGER) : BOOLEAN;
```

```python

def vs.SetOpacityN(h, inPenOpacity, inFillOpacity):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|HANDLE of the object|
|inPenOpacity|INTEGER|Pen opacity value to set.|
|inFillOpacity|INTEGER|Fill opacity value to set.|

## Version
Availability: from Vectorworks 2017
## Category
* Object Attributes